size(800, 600);
colorMode(RGB, 256, 256, 256, 100);
background(255, 255, 255);

// 筐体部分
fill(255, 0, 0);
rect(225.5, 54, 349, 492);

// 広告部分
fill(255, 255, 255);
rect(254.2, 296, 140, 91);
fill(0, 128, 0);
noStroke();
triangle(394.2, 296, 394.2, 387, 274.2, 387);
fill(0, 77, 128);
triangle(394.2,341.5, 394.2, 387, 344.2, 387);

// 取り出し口
stroke(0, 0, 0);
fill(0, 0, 0);
rect(290.5, 408.2, 200, 73);
// 取り出し口の影
fill(125, 124, 124, 50);
rect(290.5, 408.2, 200, 40);
// 金額表示部分
fill(0, 0, 0);
rect(409.2, 286.5, 48, 17);
// 金額表示部分の下の謎の四角
fill(255, 0, 0);
rect(409.2, 310.8, 48, 38);
// お金取り出し部分
fill(0, 0, 0);
rect(509.2, 466.2, 34, 34, 10);
fill(71, 71, 71, 70);
rect(509.2, 466.2, 34, 34, 10);
// お金入れる&返金レバー(左側の四角部分)
fill(0, 0, 0);
rect(509.2, 291, 34, 25, 5);
// お金入れる&返金レバー(右側の丸部分)
ellipse(540, 298, 34, 36);
// お金入れる&返金レバー(硬貨投入口のオレンジ部分)
fill(255, 127, 80);
ellipse(541, 295, 22, 22);
// お金入れる&返金レバー(硬貨投入口の銀色部分)
noStroke();
fill(161, 161, 161);
ellipse(541, 295, 17, 17);
// お金入れる&返金レバー(硬貨投入口の口部分)
stroke(0, 0, 0);
fill(0, 0, 0);
rect(536, 294, 10, 2);
// お金入れる&返金レバー(返金レバーの軸部分)
noStroke();
fill(255, 127, 80);
ellipse(515, 308, 8, 8);
// お金入れる&返金レバー(返金レバーの棒部分)
rect(515, 304, 10, 4);
// お金入れる&返金レバー(返金レバーの棒部分②)
stroke(255, 127, 80);
strokeWeight(3);
strokeCap(ROUND);
line(525, 304, 528, 300);
strokeWeight(1);
strokeCap(SQUARE);
stroke(0, 0, 0);
// お札入れるところ
fill(255, 127, 80);
rect(465.2, 303.5, 37, 26.3);
// お札入れるところの中
fill(0, 255, 0);
rect(465.2, 318.5, 37, 5);
//お札入れるところの蓋
fill(71, 71, 71, 70);
rect(465.2, 303.5, 37, 26.3);

// 商品部分の背景
fill(255, 255, 255);
rect(253.7, 75, 280.4, 193.6);
// 1段目
rect(262.9, 129.2, 262, 10.3);
// 2段目
rect(262.9, 194, 262, 10.3);
// 3段目
rect(262.9, 258.3, 262, 10.3);

//ボタン部分
strokeWeight(0.5);
fill(0, 0, 255);
// ボタン1段目
for (int i=0;i<12;i++) {
  float button1_x_diff = i*21.3;
  ellipse(277.4+button1_x_diff, 134.3, 6.5, 2.3);
}
// ボタン2段目
for (int i=0;i<12;i++) {
  float button2_x_diff = i*21.3;
  ellipse(277.4+button2_x_diff, 199.2, 6.5, 2.3);
}
// ボタン3段目
for (int i=0;i<12;i++) {
  float button3_x_diff = i*21.3;
  ellipse(277.4+button3_x_diff, 263.5, 6.5, 2.3);
}
strokeWeight(1);
fill(255, 255, 255);

// 商品1段目(一番上の段)
int[][][] item1_colors = {
  {
    {0, 0, 0},
    {255, 0, 0},
    {255, 0, 0}
  },
  {
    {0, 0, 0},
    {255, 0, 0},
    {255, 0, 0}
  },
  {
    {0, 0, 0},
    {255, 0, 0},
    {255, 0, 0}
  },
  {
    {0, 0, 0},
    {255, 0, 0},
    {255, 0, 0}
  },
  {
    {255, 0, 0}
  },
  {
    {255, 0, 0}
  },
  {
    {0, 0, 0}
  },
  {
    {0, 0, 0}
  },
  {
    {163, 3, 165}
  },
  {
    {163, 3, 165}
  },
  {
    {255, 160, 16}
  },
  {
   {255, 160, 16}
  }
};
for (int i=0;i<4;i++) {
  float item1_x_diff = i*21.3;
  fill(item1_colors[i][0][0], item1_colors[i][0][1], item1_colors[i][0][2]);
  triangle(277.4+item1_x_diff, 90, 284.4+item1_x_diff, 100, 270.4+item1_x_diff, 100);
  rect(270.4+item1_x_diff, 100, 14, 29);
  fill(item1_colors[i][1][0], item1_colors[i][1][1], item1_colors[i][1][2]);
  rect(274.95+item1_x_diff, 90, 5, 3);
  fill(item1_colors[i][2][0], item1_colors[i][2][1], item1_colors[i][2][2]);
  rect(270.4+item1_x_diff, 100, 14, 9);
}
for (int i=4;i<12;i++) {
  float item1_x_diff = i*21.3;
  fill(item1_colors[i][0][0], item1_colors[i][0][1], item1_colors[i][0][2]);
  rect(270.4+item1_x_diff, 100, 14, 28.6);
}
// 商品2段目
int[][][] item2_colors = {
  {
    {175, 223, 228},
    {255, 255, 255},
    {0, 0, 255}
  },
  {
    {175, 223, 228},
    {255, 255, 255},
    {0, 0, 255}
  },
  {
    {255, 255, 0},
    {255, 255, 255},
    {255, 160, 16}
  },
  {
    {255, 255, 0},
    {255, 255, 255},
    {255, 160, 16}
  },
  {
    {230, 247, 246},
    {0, 255, 0},
    {255, 255, 255}
  },
  {
    {230, 247, 246},
    {0, 255, 0},
    {255, 255, 255}
  },
  {
    {140, 100, 80},
    {255, 255, 255},
    {0, 255, 0}
  },
  {
    {140, 100, 80},
    {255, 255, 255},
    {0, 255, 0}
  },
  {
    {140, 100, 80},
    {255, 255, 255},
    {0, 255, 0}
  },
  {
    {140, 100, 80},
    {255, 255, 255},
    {0, 255, 0}
  },
  {
    {194, 142, 116},
    {255, 255, 255},
    {255, 255, 255}
  },
  {
    {194, 142, 116},
    {255, 255, 255},
    {255, 255, 255}
  }
};
for (int i=0;i<12;i++) {
  float item2_x_diff = i*21.3;
  float item2_y_diff = 65.6;
  fill(item2_colors[i][0][0], item2_colors[i][0][1], item2_colors[i][0][2]);
  triangle(277.4+item2_x_diff, 90+item2_y_diff, 284.4+item2_x_diff, 100+item2_y_diff, 270.4+item2_x_diff, 100+item2_y_diff);
  rect(270.4+item2_x_diff, 100+item2_y_diff, 14, 29);
  fill(item2_colors[i][1][0], item2_colors[i][1][1], item2_colors[i][1][2]);
  rect(274.95+item2_x_diff, 90+item2_y_diff, 5, 3);
  fill(item2_colors[i][2][0], item2_colors[i][2][1], item2_colors[i][2][2]);
  rect(270.4+item2_x_diff, 100+item2_y_diff, 14, 9);
}
// 商品3段目
int[][] item3_colors = {
  {0, 0, 0},
  {0, 0, 0},
  {17, 17, 136},
  {17, 17, 136},
  {201, 174, 93},
  {201, 174, 93},
  {184, 136, 59},
  {184, 136, 59},
  {255, 245, 214},
  {255, 245, 214},
  {95, 199, 147},
  {95, 199, 147},
};
for (int i=0;i<12;i++) {
  float item3_x_diff = i*21.3;
  float item3_y_diff = 75.4;
  fill(item3_colors[i][0], item3_colors[i][1], item3_colors[i][2]);
  rect(270.4+item3_x_diff, 154+item3_y_diff, 14, 28.6);
}
